{
  "0.0.26": {
    "en": "Cleaned up documentation and removed Zonneplan driver documentation.",
    "nl": "Documentatie opgeschoond en Zonneplan driver documentatie verwijderd."
  },

  "0.0.25": {
    "en": "Updated app icon with a bolder lightning bolt for improved visibility.",
    "nl": "App-pictogram bijgewerkt met een opvallendere bliksemschicht voor betere zichtbaarheid."
  },

  "0.0.24": {
    "en": "Login automatically skipped when adding PV, EV, or Meter devices if credentials already exist. Removed redundant capabilities from drivers.",
    "nl": "Inloggen automatisch overgeslagen bij toevoegen van PV, EV of Meter apparaten als inloggegevens al bestaan. Overbodige capabilities verwijderd uit drivers."
  },

  "0.0.23": {
    "en": "Added Zonneplan battery driver support. Updated app branding with new Onbalansmarkt logo and images. Enhanced visual design with improved icons.",
    "nl": "Zonneplan batterij driver ondersteuning toegevoegd. App branding bijgewerkt met nieuw Onbalansmarkt logo en afbeeldingen. Verbeterd visueel ontwerp met improved iconen."
  },

  "0.0.22": {
    "en": "Historical graphs available for trading results, rankings, and external battery metrics. Custom icons added for all capabilities.",
    "nl": "Historische grafieken beschikbaar voor handelsresultaten, rankings, en externe batterij metrieken. Aangepaste iconen toegevoegd voor alle capabilities."
  },

  "0.0.20": {
    "en": "Removed redundant meter_power capability from battery driver.",
    "nl": "Overbodige meter_power capability verwijderd uit batterij driver."
  },

  "0.0.19": {
    "en": "External battery metrics fixed. Rankings update after measurement upload. Removed duplicate capability.",
    "nl": "Externe batterij metrieken gefixed. Rankings updaten na measurement upload. Dubbele capability verwijderd."
  },

  "0.0.15": {
    "en": "Ranking data now displays correctly. Translations moved to separate locale files.",
    "nl": "Ranking data wordt nu correct weergegeven. Vertalingen verplaatst naar aparte locale bestanden."
  },

  "0.0.14": {
    "en": "Added missing capability ID fields for better compatibility and validation.",
    "nl": "Ontbrekende capability ID velden toegevoegd voor betere compatibiliteit en validatie."
  },

  "0.0.13": {
    "en": "Manual data refresh now works correctly without settings conflicts.",
    "nl": "Handmatig gegevens verversen werkt nu correct zonder instellingen conflicten."
  },

  "0.0.12": {
    "en": "Historical data graphs available for trading results, rankings, and battery metrics. App name and description now available in Dutch.",
    "nl": "Historische grafieken beschikbaar voor handelsresultaten, rankings en batterij metrieken. App naam en beschrijving nu beschikbaar in het Nederlands."
  },

  "0.0.1": {
    "en": "test",
    "nl": "test",
    "de": "test",
    "fr": "test"
  },

  "0.0.0": {
    "en": "setup proj",
    "nl": "setup proj",
    "de": "setup proj",
    "fr": "setup proj"
  }
}
