{
  "0.0.48": {
    "en": "Meter driver functionality enhanced and documentation updated. Improved device base implementation for better reliability. Updated Frank Energie client with better data handling.",
    "nl": "Meter driver functionaliteit verbeterd en documentatie bijgewerkt. Verbeterde device base implementatie voor betere betrouwbaarheid. Frank Energie client bijgewerkt met beter data handling."
  },

  "0.0.46": {
    "en": "Simulate Send action added to battery device. Shows measurement data in logs without sending to Onbalansmarkt. Capability migration now reads from driver manifest.",
    "nl": "Simuleer Verzenden actie toegevoegd aan batterij apparaat. Toont meetdata in logs zonder te verzenden naar Onbalansmarkt. Capability migratie leest nu uit driver manifest."
  },

  "0.0.45": {
    "en": "Capability migration added for EV and PV drivers. Picker and other capabilities now visible immediately without GUI refresh.",
    "nl": "Capability migratie toegevoegd voor EV en PV drivers. Picker en andere capabilities nu direct zichtbaar zonder GUI refresh."
  },

  "0.0.44": {
    "en": "Next poll timer sensor added to EV Charger and PV System drivers.",
    "nl": "Volgende poll timer sensor toegevoegd aan EV Lader en PV Systeem drivers."
  },

  "0.0.43": {
    "en": "Device initialization no longer blocked by polling alignment. Sensors populate correctly on startup.",
    "nl": "Apparaat initialisatie wordt niet meer geblokkeerd door polling uitlijning. Sensoren worden correct gevuld bij opstarten."
  },

  "0.0.42": {
    "en": "Settings save immediately without timeout. Reset baseline and all other settings changes complete within milliseconds.",
    "nl": "Instellingen worden direct opgeslagen zonder timeout. Reset baseline en alle andere instellingswijzigingen voltooien binnen milliseconden."
  },

  "0.0.40": {
    "en": "Charge limit setting removed from EV Charger driver. Driver now only displays read-only data without control settings.",
    "nl": "Laadlimiet instelling verwijderd uit EV Lader driver. Driver toont nu alleen read-only data zonder besturings instellingen."
  },

  "0.0.39": {
    "en": "Quick action disabled for EV Charger and PV System devices. Clicking device tile no longer triggers toggle action.",
    "nl": "Snelle actie uitgeschakeld voor EV Lader en PV Systeem apparaten. Klikken op apparaat tegel triggert niet langer schakelactie."
  },

  "0.0.38": {
    "en": "Load balancing active status setting added. Configure ON/OFF in battery device settings to indicate if dynamic load balancing is active. Value sent with measurements to Onbalansmarkt.",
    "nl": "Load balancing actieve status instelling toegevoegd. Configureer AAN/UIT in batterij apparaat instellingen om aan te geven of dynamische load balancing actief is. Waarde wordt meegestuurd met metingen naar Onbalansmarkt."
  },

  "0.0.37": {
    "en": "Measurements to Onbalansmarkt now include external battery metrics: average charge percentage, daily charged kWh, and daily discharged kWh (all rounded to whole numbers).",
    "nl": "Metingen naar Onbalansmarkt bevatten nu externe batterij metrieken: gemiddeld laadpercentage, dagelijks geladen kWh, en dagelijks geleverd kWh (allemaal afgerond op hele getallen)."
  },

  "0.0.36": {
    "en": "Polling alignment setting added. Configure start minute (0-59) to align polling to specific times. Example: start minute 15 with 5-minute interval polls at XX:15, XX:20, XX:25. Prevents simultaneous API calls across devices.",
    "nl": "Polling uitlijning instelling toegevoegd. Configureer start minuut (0-59) om polling uit te lijnen op specifieke tijden. Voorbeeld: start minuut 15 met 5-minuten interval pollt op XX:15, XX:20, XX:25. Voorkomt gelijktijdige API aanroepen over apparaten."
  },

  "0.0.35": {
    "en": "Polling intervals now independent per driver. Battery, EV, and PV devices accept 1-1440 minutes (default: 5 minutes). Meter device limited to 30 or 60 minutes (default: 60 minutes) due to Frank Energie API rate limits.",
    "nl": "Opvraagintervallen nu onafhankelijk per driver. Batterij, EV en PV apparaten accepteren 1-1440 minuten (standaard: 5 minuten). Meter apparaat beperkt tot 30 of 60 minuten (standaard: 60 minuten) vanwege Frank Energie API limieten."
  },

  "0.0.34": {
    "en": "Added Onbalansmarkt reported charged and discharged sensors showing battery energy values as recorded by the Onbalansmarkt API. These sensors enable verification of data integrity between local measurements and API-reported values.",
    "nl": "Onbalansmarkt gerapporteerd geladen en geleverd sensoren toegevoegd die batterij energie waarden tonen zoals geregistreerd door de Onbalansmarkt API. Deze sensoren maken verificatie mogelijk van data integriteit tussen lokale metingen en API-gerapporteerde waarden."
  },

  "0.0.33": {
    "en": "Added start-of-day baseline sensors showing charged and discharged kWh values at 00:00. These sensors help verify daily delta calculations (current total minus start-of-day equals daily value).",
    "nl": "Start-of-day baseline sensoren toegevoegd die geladen en geleverd kWh waarden om 00:00 tonen. Deze sensoren helpen bij het verifiëren van dagelijkse delta berekeningen (huidig totaal minus start-of-day is dagelijkse waarde)."
  },

  "0.0.32": {
    "en": "Picker updates optimized with debouncing and change detection. Updates only occur when battery list actually changes, preventing UI race conditions from rapid external battery data feeds.",
    "nl": "Picker updates geoptimaliseerd met debouncing en wijzigingsdetectie. Updates vinden alleen plaats wanneer de batterijlijst daadwerkelijk wijzigt, wat UI race conditions van snelle externe batterij data feeds voorkomt."
  },

  "0.0.31": {
    "en": "Pickers and capability controls now display correctly after device pairing. Added current total charged and discharged sensors showing lifetime cumulative battery values.",
    "nl": "Pickers en capability bedieningen worden nu correct weergegeven na het koppelen van apparaten. Huidige totaal geladen en geleverd sensoren toegevoegd die lifetime cumulatieve batterijwaarden tonen."
  },

  "0.0.26": {
    "en": "Added automatic daily baseline reset at 00:00 for accurate delta calculations. Added emergency reset flow card for recovery when metrics are incorrect.",
    "nl": "Automatische dagelijkse baseline reset toegevoegd om 00:00 voor nauwkeurige delta berekeningen. Nood reset flow card toegevoegd voor herstel wanneer metrieken onjuist zijn."
  },

  "0.0.25": {
    "en": "Updated app icon with a bolder lightning bolt for improved visibility.",
    "nl": "App-pictogram bijgewerkt met een opvallendere bliksemschicht voor betere zichtbaarheid."
  },

  "0.0.24": {
    "en": "Login automatically skipped when adding PV, EV, or Meter devices if credentials already exist. Removed redundant capabilities from drivers.",
    "nl": "Inloggen automatisch overgeslagen bij toevoegen van PV, EV of Meter apparaten als inloggegevens al bestaan. Overbodige capabilities verwijderd uit drivers."
  },

  "0.0.23": {
    "en": "Added Zonneplan battery driver support. Updated app branding with new Onbalansmarkt logo and images. Enhanced visual design with improved icons.",
    "nl": "Zonneplan batterij driver ondersteuning toegevoegd. App branding bijgewerkt met nieuw Onbalansmarkt logo en afbeeldingen. Verbeterd visueel ontwerp met improved iconen."
  },

  "0.0.22": {
    "en": "Historical graphs available for trading results, rankings, and external battery metrics. Custom icons added for all capabilities.",
    "nl": "Historische grafieken beschikbaar voor handelsresultaten, rankings, en externe batterij metrieken. Aangepaste iconen toegevoegd voor alle capabilities."
  },

  "0.0.20": {
    "en": "Removed redundant meter_power capability from battery driver.",
    "nl": "Overbodige meter_power capability verwijderd uit batterij driver."
  },

  "0.0.19": {
    "en": "External battery metrics fixed. Rankings update after measurement upload. Removed duplicate capability.",
    "nl": "Externe batterij metrieken gefixed. Rankings updaten na measurement upload. Dubbele capability verwijderd."
  },

  "0.0.15": {
    "en": "Ranking data now displays correctly. Translations moved to separate locale files.",
    "nl": "Ranking data wordt nu correct weergegeven. Vertalingen verplaatst naar aparte locale bestanden."
  },

  "0.0.14": {
    "en": "Added missing capability ID fields for better compatibility and validation.",
    "nl": "Ontbrekende capability ID velden toegevoegd voor betere compatibiliteit en validatie."
  },

  "0.0.13": {
    "en": "Manual data refresh now works correctly without settings conflicts.",
    "nl": "Handmatig gegevens verversen werkt nu correct zonder instellingen conflicten."
  },

  "0.0.12": {
    "en": "Historical data graphs available for trading results, rankings, and battery metrics. App name and description now available in Dutch.",
    "nl": "Historische grafieken beschikbaar voor handelsresultaten, rankings en batterij metrieken. App naam en beschrijving nu beschikbaar in het Nederlands."
  },

  "0.0.1": {
    "en": "test",
    "nl": "test",
    "de": "test",
    "fr": "test"
  },

  "0.0.0": {
    "en": "setup proj",
    "nl": "setup proj",
    "de": "setup proj",
    "fr": "setup proj"
  }
}
